#### Terraform Format and Style `failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan `success`
<details><summary>Show Plan</summary>
```

terraform
data.google_iam_policy.auth: Reading...
google_project_iam_member.cloud_run_trace_agent: Refreshing state... [id=mh-api-389212/roles/cloudtrace.agent/serviceAccount:auto-deploy@mh-api-389212.iam.gserviceaccount.com]
google_project_service.enable_api["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=mh-api-389212/cloudresourcemanager.googleapis.com]
data.google_iam_policy.auth: Read complete after 0s [id=2066618159]
data.google_service_account.terraform_sa: Reading...
data.google_iam_policy.mcp_auth: Reading...
google_project_service.enable_api["sts.googleapis.com"]: Refreshing state... [id=mh-api-389212/sts.googleapis.com]
google_project_service.enable_api["iamcredentials.googleapis.com"]: Refreshing state... [id=mh-api-389212/iamcredentials.googleapis.com]
google_project_service.enable_api["iam.googleapis.com"]: Refreshing state... [id=mh-api-389212/iam.googleapis.com]
data.google_iam_policy.mcp_auth: Read complete after 0s [id=2066618159]
google_iam_workload_identity_pool.terraform-pool: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool]
google_cloud_run_service.stg-mh-api: Refreshing state... [id=locations/asia-northeast1/namespaces/mh-api-389212/services/mh-api]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com]
google_service_account_iam_member.terraform_sa: Refreshing state... [id=projects/mh-api-389212/serviceAccounts/terraform@mh-api-389212.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/650836814988/locations/global/workloadIdentityPools/terraform-pool/attribute.repository/o-ga09/MH-API]
google_iam_workload_identity_pool_provider.terraform-provider: Refreshing state... [id=projects/mh-api-389212/locations/global/workloadIdentityPools/terraform-pool/providers/terraform-provider]
google_cloud_run_service_iam_policy.auth: Refreshing state... [id=v1/projects/mh-api-389212/locations/asia-northeast1/services/mh-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.stg-mh-api must be replaced
-/+ resource "google_cloud_run_service" "stg-mh-api" {
      ~ id                         = "locations/asia-northeast1/namespaces/mh-api-389212/services/mh-api" -> (known after apply)
      ~ name                       = "mh-api" -> "stg-mh-api" # forces replacement
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - status  = "True"
                      - type    = "Ready"
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                        # (2 unchanged attributes hidden)
                    },
                  - {
                      - status  = "True"
                      - type    = "RoutesReady"
                        # (2 unchanged attributes hidden)
                    },
                ]
              - latest_created_revision_name = "mh-api-00033-qhw"
              - latest_ready_revision_name   = "mh-api-00033-qhw"
              - observed_generation          = 37
              - traffic                      = [
                  - {
                      - latest_revision = true
                      - percent         = 100
                      - revision_name   = "mh-api-00033-qhw"
                        # (2 unchanged attributes hidden)
                    },
                ]
              - url                          = "https://mh-api-xpzdc5i4rq-an.a.run.app"
            },
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ metadata (known after apply)
      - metadata {
          - annotations           = {} -> null
          - effective_annotations = {
              - "run.googleapis.com/client-name"    = "cloud-console"
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "2edd3108-b174-43dd-938b-d3db04e6daae"
              - "run.googleapis.com/urls"           = jsonencode(
                    [
                      - "https://mh-api-650836814988.asia-northeast1.run.app",
                      - "https://mh-api-xpzdc5i4rq-an.a.run.app",
                    ]
                )
              - "serving.knative.dev/creator"       = "taitiabe1997@gmail.com"
              - "serving.knative.dev/lastModifier"  = "terraform@mh-api-389212.iam.gserviceaccount.com"
            } -> null
          - effective_labels      = {
              - "cloud.googleapis.com/location" = "asia-northeast1"
            } -> null
          - generation            = 37 -> null
          - labels                = {} -> null
          - namespace             = "mh-api-389212" -> null
          - resource_version      = "AAY2Rq1xFNY" -> null
          - self_link             = "/apis/serving.knative.dev/v1/namespaces/650836814988/services/mh-api" -> null
          - terraform_labels      = {} -> null
          - uid                   = "db8b31de-ce38-476c-b4f8-b667ed8739f0" -> null
        }

      ~ template {
          ~ metadata {
              ~ generation       = 0 -> (known after apply)
              ~ labels           = {
                  - "client.knative.dev/nonce"            = "86fed7cd-9f53-45bb-a25f-18595991e8e8"
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec {
              - node_selector         = {} -> null
              ~ service_account_name  = "auto-deploy@mh-api-389212.iam.gserviceaccount.com" -> "mh-api-389212@appspot.gserviceaccount.com"
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args        = [] -> null
                  - command     = [] -> null
                  ~ image       = "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api/mh-api:055b0f3b07c6999d3149c03aaa44c8cfa2cedfca" -> "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-api:88e584517dd921431cc744c9b108837041c110f4"
                  ~ name        = "mh-api-1" -> (known after apply)
                    # (1 unchanged attribute hidden)

                  ~ resources (known after apply)
                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                    # (9 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # google_cloud_run_service.stg-mh-mcp will be created
  + resource "google_cloud_run_service" "stg-mh-mcp" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "stg-mh-mcp"
      + project                    = "mh-api-389212"
      + status                     = (known after apply)

      + metadata (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 10
              + service_account_name  = "mh-api-389212@appspot.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/mh-api-389212/mh-api-389212/mh-mcp:88e584517dd921431cc744c9b108837041c110f4"
                  + name  = (known after apply)

                  + env {
                      + name  = "DATABASE_URL"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "DATABASE_URL"
                            }
                        }
                    }
                  + env {
                      + name  = "ENV"
                      + value = "PROD"
                    }
                  + env {
                      + name  = "GIN_MODE"
                      + value = "release"
                    }
                  + env {
                      + name  = "LOG_LEVEL"
                      + value = "INFO"
                    }
                  + env {
                      + name  = "PROJECTID"
                      + value = "mh-api"
                    }
                  + env {
                      + name  = "SENTRY_DSN"
                        # (1 unchanged attribute hidden)

                      + value_from {
                          + secret_key_ref {
                              + key  = "latest"
                              + name = "SENTRY_DSN"
                            }
                        }
                    }
                  + env {
                      + name  = "SERVICE_NAME"
                      + value = "mh-mcp"
                    }

                  + ports {
                      + container_port = 8080
                      + name           = "http1"
                    }

                  + resources (known after apply)

                  + startup_probe {
                      + failure_threshold     = 1
                      + initial_delay_seconds = 0
                      + period_seconds        = 240
                      + timeout_seconds       = 240

                      + tcp_socket {
                          + port = 8080
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.auth must be replaced
-/+ resource "google_cloud_run_service_iam_policy" "auth" {
      ~ etag        = "BwY0dJkdtNc=" -> (known after apply)
      ~ id          = "v1/projects/mh-api-389212/locations/asia-northeast1/services/mh-api" -> (known after apply)
      ~ policy_data = jsonencode(
          ~ {
              ~ bindings = [
                  ~ {
                      ~ members = [
                            "allUsers",
                          ~ "serviceAccount:auto-deploy@mh-api-389212.iam.gserviceaccount.com" -> "serviceAccount:mh-api-389212@appspot.gserviceaccount.com",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                ]
            }
        )
      ~ service     = "v1/projects/mh-api-389212/locations/asia-northeast1/services/mh-api" -> "stg-mh-api" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_cloud_run_service_iam_policy.mcp_auth will be created
  + resource "google_cloud_run_service_iam_policy" "mcp_auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                          + "serviceAccount:mh-api-389212@appspot.gserviceaccount.com",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "mh-api-389212"
      + service     = "stg-mh-mcp"
    }

  # google_project_iam_member.cloud_run_trace_agent must be replaced
-/+ resource "google_project_iam_member" "cloud_run_trace_agent" {
      ~ etag    = "BwY2Rq0RYXQ=" -> (known after apply)
      ~ id      = "mh-api-389212/roles/cloudtrace.agent/serviceAccount:auto-deploy@mh-api-389212.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:auto-deploy@mh-api-389212.iam.gserviceaccount.com" -> "serviceAccount:mh-api-389212@appspot.gserviceaccount.com" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_project_service.enable_api["artifactregistry.googleapis.com"] will be created
  + resource "google_project_service" "enable_api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "mh-api-389212"
      + service                    = "artifactregistry.googleapis.com"
    }

  # google_project_service.enable_api["cloudresourcemanager.googleapis.com"] will be destroyed
  # (because key ["cloudresourcemanager.googleapis.com"] is not in for_each map)
  - resource "google_project_service" "enable_api" {
      - disable_dependent_services = true -> null
      - disable_on_destroy         = true -> null
      - id                         = "mh-api-389212/cloudresourcemanager.googleapis.com" -> null
      - project                    = "mh-api-389212" -> null
      - service                    = "cloudresourcemanager.googleapis.com" -> null
    }

  # google_project_service.enable_api["cloudrun.googleapis.com"] will be created
  + resource "google_project_service" "enable_api" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "mh-api-389212"
      + service                    = "cloudrun.googleapis.com"
    }

  # google_project_service.enable_api["sts.googleapis.com"] will be destroyed
  # (because key ["sts.googleapis.com"] is not in for_each map)
  - resource "google_project_service" "enable_api" {
      - disable_dependent_services = true -> null
      - disable_on_destroy         = true -> null
      - id                         = "mh-api-389212/sts.googleapis.com" -> null
      - project                    = "mh-api-389212" -> null
      - service                    = "sts.googleapis.com" -> null
    }

Plan: 7 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @o-ga09, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*